tap "adoptopenjdk/openjdk"
tap "azure/functions"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "sdkman/tap"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Easiest way to build and release mobile apps
brew "fastlane"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Mac App Store command-line interface
brew "mas"
# Manage multiple Node.js versions
brew "nvm"
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm"
# Software environment for statistical computing
brew "r"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool to build, change, and version infrastructure
brew "terraform"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
# Azure Functions Core Tools 4.0
brew "azure/functions/azure-functions-core-tools@4"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Tools for building Android applications
cask "android-studio"
# Flow state app for productivity
cask "centered"
# App to build and share containerized applications and microservices
cask "docker"
# Google Chromium, sans integration with Google
cask "eloston-chromium"
# Web browser
cask "firefox"
# Monospaced font that includes programming ligatures
cask "font-cascadia-code"
# Typeface made for developers
cask "font-jetbrains-mono"
# Web browser
cask "google-chrome"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Open-source screen recorder built with web technology
cask "kap"
# Open-source keystroke visualizer
cask "keycastr"
# Clipboard manager
cask "maccy"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Email client
cask "microsoft-outlook"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Standalone app for debugging React Native apps
cask "react-native-debugger"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Native GUI tool for relational databases
cask "tableplus"
# Open-source code editor
cask "visual-studio-code"
mas "Gifski", id: 1351639930
mas "Keynote", id: 409183694
mas "Medis", id: 1579200037
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
vscode "4ops.terraform"
vscode "adpyke.codesnap"
vscode "antfu.icons-carbon"
vscode "atomiks.moonlight"
vscode "Azurite.azurite"
vscode "brittanychiang.halcyon-vscode"
vscode "christian-kohler.path-intellisense"
vscode "cssho.vscode-svgviewer"
vscode "Dart-Code.dart-code"
vscode "davidbwaters.macos-modern-theme"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "firsttris.vscode-jest-runner"
vscode "fivethree.vscode-svelte-snippets"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.azure-storage-explorer"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.vscode-pull-request-github"
vscode "hashicorp.terraform"
vscode "kamikillerto.vscode-colorize"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "meganrogge.template-string-converter"
vscode "melishev.feather-vscode"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "mongodb.mongodb-vscode"
vscode "mquandalle.graphql"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-vscode.azure-account"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtdmali.daybreak-theme"
vscode "olefjaerestad.vscode-circular-dependencies-finder"
vscode "phplasma.csv-to-table"
vscode "pmndrs.pmndrs"
vscode "Prisma.prisma"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "sdras.night-owl"
vscode "SimonSiefke.svg-preview"
vscode "sleistner.vscode-fileutils"
vscode "styled-components.vscode-styled-components"
vscode "svelte.svelte-vscode"
vscode "teabyii.ayu"
vscode "tinkertrain.theme-panda"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "ZixuanChen.vitest-explorer"
