tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "sdkman/tap"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Fast, disk space efficient package manager
brew "pnpm"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# JavaScript package manager
brew "yarn"
# Opensource IDE for exploring and testing api's
cask "bruno"
# AI-powered productivity tool for the command-line
cask "codewhisperer"
# App to build and share containerised applications and microservices
cask "docker"
# Google Chromium, sans integration with Google
cask "eloston-chromium"
# Web browser
cask "firefox"
# Monospaced font that includes programming ligatures
cask "font-cascadia-code"
# Typeface made for developers
cask "font-jetbrains-mono"
# Web browser
cask "google-chrome"
# Utility to hide menu bar items
cask "hiddenbar"
# Open-source screen recorder built with web technology
cask "kap"
# Open-source keystroke visualiser
cask "keycastr"
# Clipboard manager
cask "maccy"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Email client
cask "microsoft-outlook"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Online collaborative whiteboard platform
cask "miro"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Client-side GUI application for modern database development and operations
cask "nosql-workbench"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# HTTP debugging proxy
cask "proxyman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Native GUI tool for relational databases
cask "tableplus"
# SSH server for teams managing distributed infrastructure
cask "tsh"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Video communication and virtual meeting platform
cask "zoom"
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Medis", id: 1579200037
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
vscode "adpyke.codesnap"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "anotherglitchinthematrix.monochrome"
vscode "antfu.icons-carbon"
vscode "antfu.theme-vitesse"
vscode "ariondev.gesper"
vscode "artilleryio.vscode-artillery"
vscode "atomiks.moonlight"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "brittanychiang.halcyon-vscode"
vscode "bruno-api-client.bruno"
vscode "christian-kohler.path-intellisense"
vscode "codesandbox-io.codesandbox-projects-theme"
vscode "davidbwaters.macos-modern-theme"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "fivethree.vscode-svelte-snippets"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "janisdd.vscode-edit-csv"
vscode "kamikillerto.vscode-colorize"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "meganrogge.template-string-converter"
vscode "melishev.feather-vscode"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "miguelsolorio.symbols"
vscode "mikestead.dotenv"
vscode "mkxml.vscode-filesize"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "msrvida.vscode-sanddance"
vscode "mtdmali.daybreak-theme"
vscode "olefjaerestad.vscode-circular-dependencies-finder"
vscode "oxc.oxc-vscode"
vscode "phplasma.csv-to-table"
vscode "pmndrs.pmndrs"
vscode "pomber.git-file-history"
vscode "prisma.prisma"
vscode "raunofreiberg.vesper"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "sdras.night-owl"
vscode "simonsiefke.svg-preview"
vscode "sleistner.vscode-fileutils"
vscode "styled-components.vscode-styled-components"
vscode "svelte.svelte-vscode"
vscode "teabyii.ayu"
vscode "threadheap.serverless-ide-vscode"
vscode "tinkertrain.theme-panda"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "webnetsolutions.vstorm-color-theme"
vscode "withfig.fig"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "zoellner.openapi-preview"
